Revit 2026 API

# FabricationPartSpecification Property

---

The fabrication part specification identifier.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public int Specification { get; set; }
```
```vb
Public Property Specification As Integer
	Get
	Set
```
```cpp
public:
property int Specification {
	int get ();
	void set (int value);
}
```
```fsharp
member Specification : int with get, set
```

#### Property Value

Int32

| Exception | Condition |
| --- | --- |
| ArgumentException | When setting this property: the specification is invalid for the fabrication part. |
| InvalidOperationException | When setting this property: the specification is not able to be modified. -or- When setting this property: the fabrication part is connected to more than one item. -or- When setting this property: the specification fails to be set by identifier: specId. |

A value of 0 indicates the specification is set to undefined.

#### Reference

FabricationPart Class

Autodesk.Revit.DB Namespace